In [1]:
# examples and exercises in chapter 2.1 of the Chinese version of book "Joyful Pandas" (pandas数据处理与分析)

In [1]:
import numpy as np
import pandas as pd

In [11]:
import os
os.chdir("../../")

In [12]:
np.__version__

'1.26.4'

In [13]:
pd.__version__

'2.2.1'

In [14]:
# 2.1.1

In [16]:
df_csv = pd.read_csv("data/ch2/my_csv.csv")
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

In [17]:
df_txt = pd.read_table("data/ch2/my_table.txt")
df_txt

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

In [18]:
df_excel = pd.read_excel("data/ch2/my_excel.xlsx")
df_excel

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

In [10]:
pd.read_table("../../data/ch2/my_table.txt", header=None)

      0     1     2       3         4
0  col1  col2  col3    col4      col5
1     2     a   1.4   apple  2020/1/1
2     3     b   3.4  banana  2020/1/2
3     6     c   2.5  orange  2020/1/5

In [19]:
pd.read_csv("data/ch2/my_csv.csv", index_col=["col1", "col2"])

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5

In [20]:
pd.read_table("data/ch2/my_table.txt", usecols=["col1", "col2"])

   col1 col2
0     2    a
1     3    b
2     6    c

In [25]:
df = pd.read_csv("data/ch2/my_csv.csv", parse_dates=["col5"])
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    3 non-null      object
 2   col3    3 non-null      float64
 3   col4    3 non-null      object
 4   col5    3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 248.0+ bytes
None

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05

In [29]:
pd.read_excel("data/ch2/my_excel.xlsx", nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

In [32]:
pd.read_table("data/ch2/my_table_special_sep.txt", sep="\|\|\|\|", engine="python")

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!

In [33]:
# 2.1.2

In [34]:
df_csv.to_csv("data/ch2/my_csv_saved.csv", index=False)
df_excel.to_excel("data/ch2/myexcel_saved.xlsx", index=False)

In [36]:
# Ex2-1

In [37]:
df_csv.to_csv("data/ch2/my_csv_saved2.csv", index=True)
df_excel.to_excel("data/ch2/myexcel_saved2.xlsx", index=True)

In [38]:
#

In [39]:
df_txt.to_csv("data/ch2/my_txt_saved.txt", sep="\t", index=False)

In [40]:
print(df.to_markdown())

|    |   col1 | col2   |   col3 | col4   | col5                |
|---:|-------:|:-------|-------:|:-------|:--------------------|
|  0 |      2 | a      |    1.4 | apple  | 2020-01-01 00:00:00 |
|  1 |      3 | b      |    3.4 | banana | 2020-01-02 00:00:00 |
|  2 |      6 | c      |    2.5 | orange | 2020-01-05 00:00:00 |

In [41]:
print(df.style.to_latex())

\begin{tabular}{lrlrll}
 & col1 & col2 & col3 & col4 & col5 \\
0 & 2 & a & 1.400000 & apple & 2020-01-01 00:00:00 \\
1 & 3 & b & 3.400000 & banana & 2020-01-02 00:00:00 \\
2 & 6 & c & 2.500000 & orange & 2020-01-05 00:00:00 \\
\end{tabular}